structurizr-export/test/unit/com/structurizr/io/dot/54915-AmazonWebServicesDeployment.dot
digraph {
  compound=true
  graph [fontname="Arial", rankdir=LR, ranksep=1.0, nodesep=1.0]
  node [fontname="Arial", shape=box, margin="0.4,0.3"]
  edge [fontname="Arial"]
  label=<<br /><font point-size="34">Spring PetClinic - Deployment - Default</font><br /><font point-size="24">An example deployment diagram.</font>>

  subgraph cluster_5 {
    margin=25
    label=<<font point-size="24">Amazon Web Services</font><br /><font point-size="19">[Deployment Node]</font>>
    labelloc=b
    color="#232f3e"
    fontcolor="#232f3e"
    fillcolor="#ffffff"

    subgraph cluster_6 {
      margin=25
      label=<<font point-size="24">US-East-1</font><br /><font point-size="19">[Deployment Node]</font>>
      labelloc=b
      color="#147eba"
      fontcolor="#147eba"
      fillcolor="#ffffff"

      subgraph cluster_14 {
        margin=25
        label=<<font point-size="24">Amazon RDS</font><br /><font point-size="19">[Deployment Node]</font>>
        labelloc=b
        color="#3b48cc"
        fontcolor="#3b48cc"
        fillcolor="#ffffff"

        subgraph cluster_15 {
          margin=25
          label=<<font point-size="24">MySQL</font><br /><font point-size="19">[Deployment Node]</font>>
          labelloc=b
          color="#3b48cc"
          fontcolor="#3b48cc"
          fillcolor="#ffffff"

          16 [id=16,shape=cylinder, label=<<font point-size="34">Database</font><br /><font point-size="19">[Container: Relational database schema]</font><br /><br /><font point-size="24">Stores information regarding<br />the veterinarians, the<br />clients, and their pets.</font>>, style=filled, color="#b2b2b2", fillcolor="#ffffff", fontcolor="#000000"]
        }

      }

      subgraph cluster_7 {
        margin=25
        label=<<font point-size="24">Autoscaling group</font><br /><font point-size="19">[Deployment Node]</font>>
        labelloc=b
        color="#cc2264"
        fontcolor="#cc2264"
        fillcolor="#ffffff"

        subgraph cluster_8 {
          margin=25
          label=<<font point-size="24">Amazon EC2</font><br /><font point-size="19">[Deployment Node]</font>>
          labelloc=b
          color="#d86613"
          fontcolor="#d86613"
          fillcolor="#ffffff"

          9 [id=9,shape=rect, label=<<font point-size="34">Web Application</font><br /><font point-size="19">[Container: Java and Spring Boot]</font><br /><br /><font point-size="24">Allows employees to view and<br />manage information regarding<br />the veterinarians, the<br />clients, and their pets.</font>>, style=filled, color="#b2b2b2", fillcolor="#ffffff", fontcolor="#000000"]
        }

      }

      11 [id=11,shape=rect, label=<<font point-size="34">Elastic Load Balancer</font><br /><font point-size="19">[Infrastructure Node]</font>>, style=filled, color="#693cc5", fillcolor="#ffffff", fontcolor="#693cc5"]
      10 [id=10,shape=rect, label=<<font point-size="34">Route 53</font><br /><font point-size="19">[Infrastructure Node]</font>>, style=filled, color="#693cc5", fillcolor="#ffffff", fontcolor="#693cc5"]
    }

  }

  10 -> 11 [id=12, label=<<font point-size="24">Forwards requests to</font><br /><font point-size="19">[HTTPS]</font>>, style="dashed", color="#707070", fontcolor="#707070"]
  11 -> 9 [id=13, label=<<font point-size="24">Forwards requests to</font><br /><font point-size="19">[HTTPS]</font>>, style="dashed", color="#707070", fontcolor="#707070"]
  9 -> 16 [id=17, label=<<font point-size="24">Reads from and writes to</font><br /><font point-size="19">[JDBC/SSL]</font>>, style="dashed", color="#707070", fontcolor="#707070"]
}
